app/controllers/things_controller.rb

  def check
    @thing = Thing.find(params[:id])
    @thing.pending = !@thing.pending
    @thing.update_attributes(params[@thing])
---
SELECT * FROM "things" WHERE ("things"."id" = 1)
UPDATE "things" SET "updated_at" = '2010-08-31 23:30:20', "pending" = 'f' WHERE "id" = 1

  def index
    @things = Thing.all
---
SELECT * FROM "things"

  def edit
    @thing = Thing.find(params[:id])
---
SELECT * FROM "things" WHERE ("things"."id" = 1)

  def create
    @thing = Thing.new(params[:thing])

    respond_to do |format|
      if @thing.save
---
INSERT INTO "things" ("pending", "created_at", "title", "body", "updated_at") VALUES('f', '2010-08-28 00:12:36', 'git', 'jogar projetos no repo é com push', '2010-08-28 00:12:36')

  def update
    @thing = Thing.find(params[:id])

    respond_to do |format|
      if @thing.update_attributes(params[:thing])
---
SELECT * FROM "things" WHERE ("things"."id" = 1)
UPDATE "things" SET "updated_at" = '2010-08-28 00:12:47', "pending" = 't' WHERE "id" = 1

  def destroy
    @thing = Thing.find(params[:id])
    @thing.destroy
---
SELECT * FROM "things" WHERE ("things"."id" = 2)
DELETE FROM "things" WHERE "id" = 2